Repository: nerosketch/djing2
Catalog: apps/dynamicfields/locale/*/LC_MESSAGES/django.po
Languages: ru

source: '%(value)s' value must be a float.
ru: '%(value)s' значение должно быть числом с плавающей точкой.

source: Dynamic content field (up to %(max_length)s)
ru: Динамическое поле с контентом (up to %(max_length)s)

source: Char Field
ru: Строковое поле

source: Integer Field
ru: Числовое поле

source: Email Field
ru: Поле почты

source: Ip Field
ru: Поле ip адрес

source: Float Field
ru: Поле дробного числа

source: Title
ru: Название

source: Field type
ru: Тип поля

source: Groups
ru: Группы

source: Tags must contain only word characters (equivalent to [a-zA-Z0-9_]). And separated by comma.
ru: Тэги должны содержать только буквы, цифры и знак подчёркивания (как [a-zA-Z0-9_]). И могут быть разделены запятой.

source: Default tag
ru: Тэк по умолчанию

source: Uses IPTV
ru: Использует IPTV

source: System tag
ru: Системный тэг

source: User tag
ru: Пользовательский тэг
