Repository: nerosketch/djing2
Catalog: apps/sorm_export/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Customer "%s" [%s] has no address
ru: Абонент не имеет адрес; "%s" [%s]

source: Customer "%s" has address without parent address object
ru: Абонент не имеет в адресе родительского объекта; "%s"

source: Customer "%s" [%s] has no house nor office in address "%s"
ru: Абонент не имеет ни офиса ни номера дома в адресе; "%s" [%s] "%s"

source: Customer "%s" with login "%s" address has no parent street element
ru: Абонент не имеет улицы в адресе; "%s" "%s"

source: Customer "%s" [%s] has no passport info
ru: Абонент не имеет паспортных данных; "%s" [%s]

source: Legal customer "%s" with login "%s" post address has no parent street element
ru: Юридический абонент не имеет улицы в адресе; "%s" "%s"

source: Legal customer "%s" with login "%s" delivery address has no parent street element
ru: Юридический абонент не имеет улицы в адресе доставки счёта; "%s" "%s"

source: Not exported
ru: Не экспортирован

source: Successful
ru: Успешно

source: Failed
ru: Ошибка

source: Action time
ru: Дата действия

source: Last attempt time
ru: Дата последней попытки

source: Attempt count
ru: Количество попыток

source: Export status
ru: Статус экспорта

source: Export type
ru: Тип экспорта

source: Export event data
ru: Дата события экспорта

source: Individual entity
ru: Физическое лицо

source: Legal entity
ru: Юридическое лицо

source: Passport RF
ru: Паспорт РФ

source: Passport USSR
ru: Паспорт СССР

source: Passport other country
ru: Паспорт иностранного гражданина

source: Military ticket
ru: Военный билет

source: Output voip dial
ru: Исходящий звонок voip

source: Input voip dial
ru: Входящий звонок voip

source: Service id
ru: ID Услуги

source: Customer id
ru: ID Абонента

source: Legal customer id
ru: ID абонента

source: Date of conclusion of the contract
ru: Дата заключения контракта

source: Customer login
ru: Логин абонента

source: Communication_standard
ru: Стандарт связи

source: Contract ID
ru: ID Договора

source: Contract completion date
ru: Дата завершения контракта

source: Contract number
ru: Номер договора

source: Contract title
ru: Название договора

source: Address id
ru: ID адреса

source: Parent address id
ru: ID родительского адреса

source: Address type id
ru: ID типа адреса

source: Region type
ru: Тип региона

source: Title
ru: Название

source: Full address title
ru: Полноый название адреса

source: Access point id
ru: ID точки подключения

source: House
ru: Дом

source: Full address
ru: Полный адрес

source: Internal address
ru: Внутренний адрес

source: Parent ao id
ru: ID родительского адреса

source: Building
ru: Здание

source: Building corpus
ru: Корпус

source: Full description
ru: Полное описание

source: Actual start time
ru: Дата начала интервала, на котором инфорация актуальна

source: Actual end time
ru: Дата конца интервала, на котором инфорация актуальна

source: Individual customer name
ru: Имя абонента

source: Birthday
ru: Дата рождения

source: Document type
ru: Тип документа

source: Document serial
ru: Серия документа

source: Document number
ru: Номер документа

source: Document distributor
ru: Кем выдан документ

source: House number
ru: Номер дома

source: Legal title
ru: Название юридического лица

source: Customer bank
ru: Банк абонента

source: Bank receipt number
ru: Банковский расчётный счёт

source: Contact telephones
ru: Контактный телефоны

source: Contact info
ru: Контактная информация

source: Gray addr
ru: Серый адрес

source: White addr
ru: Белый адрес

source: VPN addr
ru: VPN адрес

source: Payment time
ru: Время платежа

source: Pay amount
ru: Сумма платежа

source: Service description
ru: Описание тарифа

source: Operator type id
ru: Тип оператора
