Repository: nerosketch/djing2
Catalog: apps/customers_legal/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Not chosen
ru: Не выбрано

source: Legal customer
ru: Юридическое лицо

source: Individual businessman
ru: ИП (индивидуальный предприниматель)

source: Self employed
ru: Самозанятый

source: Legal customer group
ru: Группа Юр лица

source: Branches
ru: Филиалы

source: Legal type
ru: Тип юридическоого лица

source: Tax number
ru: Налоговый номер

source: State-level registration number
ru: ОГРН

source: Actual start time
ru: дата начала интервала, на котором актуальна информация

source: Actual end time
ru: дата окончания интервала, на котором актуальна информация

source: Title
ru: Название

source: Comment
ru: Памятка

source: Bank identify code
ru: БИК

source: Correspondent account
ru: Корреспондентский счёт

source: Settlement account
ru: Расчётный счёт

source: Telephone
ru: Телефон
