Repository: nerosketch/djing2
Catalog: apps/fin_app/locale/*/LC_MESSAGES/django.po
Languages: ru, uz

source: Secret
ru: Секрет

source: All time gateway
ru: Платёжный шлюз AllTime
uz: All time шлюз

source: Trade point
ru: Торговая точка
uz: Савдо шахобчаси

source: Receipt number
ru: Номер квитанции
uz: Квитанция номери

source: Unknown
ru: Не известно
uz: Номаълум

source: Title
ru: Название
uz: Ном

source: Base gateway
ru: Базовый Платёжный шлюз
uz: Базавий шлюз

source: Pay gateway
ru: Платёжный шлюз
uz: Тулов шлюзи

source: Cost
ru: Цена
uz: Қиймат

source: Base payment log
ru: Базовый платёжный лог
uz: Туловларнинг базавий журнали

source: Unknown error
ru: Не известная ошибка
uz: Номалум хатолик

source: Incorrect authentication credentials.
ru: Не получается войти с предоставленными учётными данными
uz: Хисоб маълумотларининг аутентификацияси учун нотуғри маълумотлар

source: Method not found
ru: Метод не найден
uz: Услуб топилмади

source: Transaction not found
ru: Транзакции не найдены
uz: Транзакция топилмади

source: Bad transaction type
ru: Не правильный тип транзакции
uz: Транзакциянинг номаъқул тури

source: Transaction is timed out
ru: Время транзакции истекло
uz: Транзакция вақтга бўйича тугалланди

source: Customer does not exists
ru: Абонент не найден
uz: Мижоз мавжуд эмас

source: Not allowed to cancel transaction
ru: Запрещено отменять транцакции
uz: Транзакцияни ортга қайтариш мумкин эмас

source: Validation error
ru: Ошибка валидации
uz: Валидация хатолиги

source: RNCB gateway
ru: Платёжный шлюз РНКБ
uz: РНКБ шлюзи

source: Act time from payment system
ru: Время платежа из платёжной системы
uz: Тўлов системасининг ишлаш вақти

source: Enter a valid ID value.
ru: Введите валидный ID
uz: ID нинг амалдаги сонини киритинг

source: Invalid login header. No credentials provided.
ru: Не правильный заголовок авторизации. Данные для авторизации не предоставлены.
uz: Kirish sarlavhasi xato. Yo'q, hisobga olish ma'lumotlari taqdim.

source: Invalid login header. Credentials string should not contain spaces.
ru: Не правильный заголовок авторизации. Данные для авторизации не должны содержать пробелы.
uz: Логин номи нотуғри. Хисобга олиш қаторида оралиқ қолидириш мумкин мумкин эмас.

source: Invalid credentials header. Credentials string should not contain invalid characters.
ru: Не правильный заголовок авторизации. Данные для авторизации не должны содержать не допустимые символы.
uz: Логин номи нотуғри. Хисобга олиш қаторида маън этилган катталик киритилиши мумкин эмас.

source: Invalid username/password.
ru: Не верный логин/пароль
uz: Фойдаланувчи исми / пароли нотўғри.

source: HTTP Method is not allowed
ru: HTTP метод не допустим
uz: НТТР методи таъқиқланан

source: Data validation error
ru: Ошибка валидации данных
uz: Маълумотлар текширишдаги хатолик
