Repository: nerosketch/djing2
Catalog: apps/networks/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Vlan title
ru: Название vlan

source: Vid could not be less then 2
ru: VID не может быть меньше чем 2

source: Vid could not be more than 4094
ru: VID не может быть больше чем 4094

source: Is management
ru: Управляемый

source: Vlan list
ru: Список vlan

source: Not defined
ru: Не определённая

source: Internet
ru: Интернет

source: Guest
ru: Гостевая

source: Trusted
ru: Доверенная

source: Devices
ru: Устройства

source: Admin
ru: Административная

source: Ip network address
ru: IP адрес сети

source: Ip address of network. For example: 192.168.1.0/24 or fde8:6789:1234:1::/64
ru: IP адрес подсети. На пример: 192.168.1.0/24 or fde8:6789:1234:1::/64

source: Kind of network
ru: Тип сети

source: Description
ru: Описание

source: Member groups
ru: Группы

source: Start work ip range
ru: Начальный ip из диапазона

source: End work ip range
ru: Конечный ip из диапазона

source: Vlan interface
ru: Интерфейс vlan

source: Gateway ip address
ru: IP адрес шлюза

source: Is dynamic
ru: Динамичейский

source: Network is invalid
ru: Подсеть не правильная

source: Ip start is invalid
ru: Начальный ip из диапазона не верный

source: Start ip must be in subnet of specified network
ru: Начальный ip должен быть в указанной подсети

source: Ip end is invalid
ru: Конечный ip из диапазона не верный

source: End ip must be in subnet of specified network
ru: Конечный ip должен быть в указанной подсети

source: Gateway ip must be in subnet of specified network
ru: Шлюз должен принадлежать текущей подсети

source: Gateway must not be in the range of allowed ips
ru: Шлюз не должен быть в диапазоне доступных ip

source: Network is overlaps with %(other_network)s
ru: Подсеть пересекается с сетью '%(other_network)s'

source: Network ip pool
ru: Подсеть

source: Network ip pools
ru: Подсети

source: Ip address
ru: IP адрес

source: Lease time
ru: Время аредны

source: Mac address
ru: MAC адрес

source: IP lease
ru: IP аренда

source: IP leases
ru: IP аренды

source: Event time
ru: Время аренды

source: Lease end use time
ru: Время окончания использования аренды

source: Network can not be empty
ru: Сеть не может быть пустой

source: Ping ok
ru: Пингуется OK

source: no ping
ru: не пингуется

source: Process locked by another process
ru: Процесс занят другой задачей, подождите чуть и попробуйте ещё

source: Radius session not found error
ru: Сессия не найдена

source: Not allowed to add ip from dynamic pool as static
ru: Запрещено добавлять ip из динамического пула статически
